; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22bufio\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22http\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22net/http\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22net/http\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22\\\22\\n\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !5, globals: !6)
!4 = !DIFile(filename: "main.go", directory: "/home/virtualvms/Documents/GitHub/Fabric-Verify/go-llvm-testing/gocodes")
!5 = !{}
!6 = !{!7, !24, !36, !38, !40, !42, !44, !46, !48, !50, !52, !54, !56, !58, !60, !62, !64, !66, !68, !70, !72, !74, !76, !78, !80, !82, !84, !86, !88, !90, !92, !94, !96, !98, !100, !102, !104, !106, !108, !110, !112, !114, !116, !118, !120, !122, !124, !126, !128, !130, !132, !134, !136, !138, !140, !142, !144, !146, !148, !150, !152, !154, !156, !158, !160, !162, !164, !166, !168, !170, !172, !174, !176, !178, !180, !182, !184, !186, !188, !190, !192, !194, !196, !198, !200, !202, !204, !206, !208, !210, !212, !214, !216, !218, !220, !222, !224, !226, !228, !230, !232, !234}
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !3, file: !9, line: 1, type: !10, isLocal: false, isDefinition: true)
!9 = !DIFile(filename: "<built-in>", directory: "")
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{bool,[3]uint8,bool,bool,uint64}", file: !11, size: 128, align: 8, elements: !12)
!11 = !DIFile(filename: "", directory: "")
!12 = !{!13, !15, !20, !21, !22}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", file: !11, line: 1, baseType: !14, size: 8, align: 8)
!14 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "pad", file: !11, line: 1, baseType: !16, size: 24, align: 8, offset: 8)
!16 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 24, align: 1, elements: !18)
!17 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!18 = !{!19}
!19 = !DISubrange(count: 3)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "needed", file: !11, line: 1, baseType: !14, size: 8, align: 8, offset: 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "cgo", file: !11, line: 1, baseType: !14, size: 8, align: 8, offset: 40)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "alignme", file: !11, line: 1, baseType: !23, size: 64, align: 64, offset: 64)
!23 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "bufio..types", linkageName: "bufio..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,[1]*void}", file: !11, size: 128, align: 8, elements: !27)
!27 = !{!28, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !11, line: 1, baseType: !29, size: 64, align: 64)
!29 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "types", file: !11, line: 1, baseType: !31, size: 64, align: 64, offset: 64)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 64, align: 8, elements: !34)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIBasicType(name: "void")
!34 = !{!35}
!35 = !DISubrange(count: 1)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "bytes..types", linkageName: "bytes..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "compress..z2fflate..types", linkageName: "compress..z2fflate..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "compress..z2fgzip..types", linkageName: "compress..z2fgzip..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "context..types", linkageName: "context..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "crypto..types", linkageName: "crypto..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "crypto..z2fcipher..types", linkageName: "crypto..z2fcipher..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "crypto..z2fdsa..types", linkageName: "crypto..z2fdsa..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "crypto..z2fecdsa..types", linkageName: "crypto..z2fecdsa..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "crypto..z2felliptic..types", linkageName: "crypto..z2felliptic..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "crypto..z2finternal..z2frandutil..types", linkageName: "crypto..z2finternal..z2frandutil..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "crypto..z2fmd5..types", linkageName: "crypto..z2fmd5..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "crypto..z2frand..types", linkageName: "crypto..z2frand..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "crypto..z2frsa..types", linkageName: "crypto..z2frsa..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "crypto..z2fsha1..types", linkageName: "crypto..z2fsha1..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "crypto..z2fsha256..types", linkageName: "crypto..z2fsha256..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "crypto..z2fsha512..types", linkageName: "crypto..z2fsha512..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "crypto..z2ftls..types", linkageName: "crypto..z2ftls..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "crypto..z2fx509..types", linkageName: "crypto..z2fx509..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "crypto..z2fx509..z2fpkix..types", linkageName: "crypto..z2fx509..z2fpkix..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "encoding..z2fasn1..types", linkageName: "encoding..z2fasn1..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "encoding..z2fbase64..types", linkageName: "encoding..z2fbase64..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "encoding..z2fbinary..types", linkageName: "encoding..z2fbinary..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "encoding..z2fhex..types", linkageName: "encoding..z2fhex..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "encoding..z2fpem..types", linkageName: "encoding..z2fpem..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "errors..types", linkageName: "errors..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "fmt..types", linkageName: "fmt..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "golang.x2eorg..z2fx..z2fcrypto..z2fchacha20..types", linkageName: "golang.x2eorg..z2fx..z2fcrypto..z2fchacha20..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "golang.x2eorg..z2fx..z2fcrypto..z2fchacha20poly1305..types", linkageName: "golang.x2eorg..z2fx..z2fcrypto..z2fchacha20poly1305..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "golang.x2eorg..z2fx..z2fcrypto..z2fcryptobyte..types", linkageName: "golang.x2eorg..z2fx..z2fcrypto..z2fcryptobyte..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "golang.x2eorg..z2fx..z2fcrypto..z2fcurve25519..types", linkageName: "golang.x2eorg..z2fx..z2fcrypto..z2fcurve25519..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "golang.x2eorg..z2fx..z2fnet..z2fdns..z2fdnsmessage..types", linkageName: "golang.x2eorg..z2fx..z2fnet..z2fdns..z2fdnsmessage..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "golang.x2eorg..z2fx..z2fnet..z2fhttp..z2fhttpguts..types", linkageName: "golang.x2eorg..z2fx..z2fnet..z2fhttp..z2fhttpguts..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "golang.x2eorg..z2fx..z2fnet..z2fhttp..z2fhttpproxy..types", linkageName: "golang.x2eorg..z2fx..z2fnet..z2fhttp..z2fhttpproxy..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "golang.x2eorg..z2fx..z2fnet..z2fhttp2..z2fhpack..types", linkageName: "golang.x2eorg..z2fx..z2fnet..z2fhttp2..z2fhpack..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "golang.x2eorg..z2fx..z2fnet..z2fidna..types", linkageName: "golang.x2eorg..z2fx..z2fnet..z2fidna..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "golang.x2eorg..z2fx..z2ftext..z2fsecure..z2fbidirule..types", linkageName: "golang.x2eorg..z2fx..z2ftext..z2fsecure..z2fbidirule..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "golang.x2eorg..z2fx..z2ftext..z2ftransform..types", linkageName: "golang.x2eorg..z2fx..z2ftext..z2ftransform..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "golang.x2eorg..z2fx..z2ftext..z2funicode..z2fbidi..types", linkageName: "golang.x2eorg..z2fx..z2ftext..z2funicode..z2fbidi..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "golang.x2eorg..z2fx..z2ftext..z2funicode..z2fnorm..types", linkageName: "golang.x2eorg..z2fx..z2ftext..z2funicode..z2fnorm..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "hash..z2fcrc32..types", linkageName: "hash..z2fcrc32..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "internal..z2fcpu..types", linkageName: "internal..z2fcpu..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "internal..z2foserror..types", linkageName: "internal..z2foserror..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "internal..z2fpoll..types", linkageName: "internal..z2fpoll..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "internal..z2freflectlite..types", linkageName: "internal..z2freflectlite..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "internal..z2ftestlog..types", linkageName: "internal..z2ftestlog..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "io..types", linkageName: "io..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "io..z2fioutil..types", linkageName: "io..z2fioutil..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "log..types", linkageName: "log..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "math..z2fbig..types", linkageName: "math..z2fbig..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "math..z2frand..types", linkageName: "math..z2frand..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "mime..types", linkageName: "mime..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "mime..z2fmultipart..types", linkageName: "mime..z2fmultipart..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "mime..z2fquotedprintable..types", linkageName: "mime..z2fquotedprintable..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "net..types", linkageName: "net..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "net..z2fhttp..types", linkageName: "net..z2fhttp..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "net..z2fhttp..z2finternal..types", linkageName: "net..z2fhttp..z2finternal..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "net..z2ftextproto..types", linkageName: "net..z2ftextproto..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "os..types", linkageName: "os..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "path..types", linkageName: "path..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "path..z2ffilepath..types", linkageName: "path..z2ffilepath..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "reflect..types", linkageName: "reflect..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "runtime..types", linkageName: "runtime..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "runtime..z2finternal..z2fsys..types", linkageName: "runtime..z2finternal..z2fsys..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "sort..types", linkageName: "sort..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "strconv..types", linkageName: "strconv..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "sync..types", linkageName: "sync..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "syscall..types", linkageName: "syscall..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "time..types", linkageName: "time..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "unicode..types", linkageName: "unicode..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "container..z2flist..types", linkageName: "container..z2flist..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "crypto..z2faes..types", linkageName: "crypto..z2faes..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "crypto..z2fdes..types", linkageName: "crypto..z2fdes..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "crypto..z2fed25519..types", linkageName: "crypto..z2fed25519..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "crypto..z2fed25519..z2finternal..z2fedwards25519..types", linkageName: "crypto..z2fed25519..z2finternal..z2fedwards25519..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "crypto..z2fhmac..types", linkageName: "crypto..z2fhmac..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "crypto..z2finternal..z2fsubtle..types", linkageName: "crypto..z2finternal..z2fsubtle..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "crypto..z2frc4..types", linkageName: "crypto..z2frc4..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "crypto..z2fsubtle..types", linkageName: "crypto..z2fsubtle..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "golang.x2eorg..z2fx..z2fcrypto..z2fcryptobyte..z2fasn1..types", linkageName: "golang.x2eorg..z2fx..z2fcrypto..z2fcryptobyte..z2fasn1..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "golang.x2eorg..z2fx..z2fcrypto..z2fhkdf..types", linkageName: "golang.x2eorg..z2fx..z2fcrypto..z2fhkdf..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "golang.x2eorg..z2fx..z2fcrypto..z2finternal..z2fsubtle..types", linkageName: "golang.x2eorg..z2fx..z2fcrypto..z2finternal..z2fsubtle..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "golang.x2eorg..z2fx..z2fcrypto..z2fpoly1305..types", linkageName: "golang.x2eorg..z2fx..z2fcrypto..z2fpoly1305..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "hash..types", linkageName: "hash..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "internal..z2fbytealg..types", linkageName: "internal..z2fbytealg..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "internal..z2ffmtsort..types", linkageName: "internal..z2ffmtsort..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "internal..z2fnettrace..types", linkageName: "internal..z2fnettrace..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "internal..z2frace..types", linkageName: "internal..z2frace..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "internal..z2fsingleflight..types", linkageName: "internal..z2fsingleflight..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "internal..z2fsyscall..z2fexecenv..types", linkageName: "internal..z2fsyscall..z2fexecenv..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "internal..z2fsyscall..z2funix..types", linkageName: "internal..z2fsyscall..z2funix..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "math..types", linkageName: "math..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "math..z2fbits..types", linkageName: "math..z2fbits..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "net..z2fhttp..z2fhttptrace..types", linkageName: "net..z2fhttp..z2fhttptrace..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "net..z2furl..types", linkageName: "net..z2furl..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "runtime..z2finternal..z2fatomic..types", linkageName: "runtime..z2finternal..z2fatomic..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "runtime..z2finternal..z2fmath..types", linkageName: "runtime..z2finternal..z2fmath..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "strings..types", linkageName: "strings..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "sync..z2fatomic..types", linkageName: "sync..z2fatomic..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "unicode..z2futf16..types", linkageName: "unicode..z2futf16..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "unicode..z2futf8..types", linkageName: "unicode..z2futf8..types", scope: !3, file: !11, type: !26, isLocal: false, isDefinition: true)
!236 = distinct !DISubprogram(name: "main.__go_init_main", linkageName: "__go_init_main", scope: null, file: !237, line: 1, type: !238, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!237 = !DIFile(filename: "main.go", directory: "")
!238 = !DISubroutineType(types: !239)
!239 = !{!33}
!240 = !DILocation(line: 1, column: 1, scope: !241)
!241 = !DILexicalBlockFile(scope: !236, file: !9, discriminator: 0)
!242 = distinct !DISubprogram(name: "main.main", linkageName: "main.main", scope: null, file: !237, line: 9, type: !238, scopeLine: 9, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!243 = !DILocation(line: 11, column: 23, scope: !244)
!244 = distinct !DILexicalBlock(scope: !242, file: !237, line: 9, column: 1)
!245 = !DILocation(line: 27, column: 1, scope: !242)
!246 = !DILocalVariable(name: "resp", scope: !244, file: !237, line: 11, type: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !237, line: 6, size: 1152, align: 8, elements: !249)
!249 = !{!250, !256, !257, !258, !259, !260, !276, !352, !354, !358, !359, !360, !361, !641}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !237, line: 6, baseType: !251, size: 128, align: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !9, line: 1, size: 128, align: 8, elements: !252)
!252 = !{!253, !255}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !9, line: 1, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !9, line: 1, baseType: !29, size: 64, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "StatusCode", file: !237, line: 6, baseType: !29, size: 64, align: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Proto", file: !237, line: 6, baseType: !251, size: 128, align: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMajor", file: !237, line: 6, baseType: !29, size: 64, align: 64, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMinor", file: !237, line: 6, baseType: !29, size: 64, align: 64, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "Header", file: !237, line: 6, baseType: !261, size: 64, align: 64, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !9, line: 1, size: 384, align: 8, elements: !263)
!263 = !{!264, !265, !266, !267, !269, !271, !272, !273, !275}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !9, line: 1, baseType: !29, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !9, line: 1, baseType: !17, size: 8, align: 8, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !9, line: 1, baseType: !17, size: 8, align: 8, offset: 72)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !9, line: 1, baseType: !268, size: 16, align: 16, offset: 80)
!268 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !9, line: 1, baseType: !270, size: 32, align: 32, offset: 96)
!270 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !9, line: 1, baseType: !32, size: 64, align: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !9, line: 1, baseType: !32, size: 64, align: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !9, line: 1, baseType: !274, size: 64, align: 64, offset: 256)
!274 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !9, line: 1, baseType: !32, size: 64, align: 64, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "Body", file: !237, line: 6, baseType: !277, size: 128, align: 64, offset: 512)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadCloser", file: !237, line: 6, size: 128, align: 8, elements: !278)
!278 = !{!279, !351}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !237, line: 6, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !11, size: 192, align: 8, elements: !282)
!282 = !{!283, !324, !340}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !11, line: 6, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !9, line: 1, size: 512, align: 8, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293, !294, !302, !303, !305, !323}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !9, line: 1, baseType: !274, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !9, line: 1, baseType: !274, size: 64, align: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !9, line: 1, baseType: !270, size: 32, align: 32, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !9, line: 1, baseType: !17, size: 8, align: 8, offset: 160)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !9, line: 1, baseType: !17, size: 8, align: 8, offset: 168)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !9, line: 1, baseType: !17, size: 8, align: 8, offset: 176)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !9, line: 1, baseType: !17, size: 8, align: 8, offset: 184)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !9, line: 1, baseType: !295, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !9, line: 1, size: 64, align: 8, elements: !297)
!297 = !{!298}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !9, line: 1, baseType: !299, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!14, !32, !32}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !9, line: 1, baseType: !254, size: 64, align: 64, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !9, line: 1, baseType: !304, size: 64, align: 64, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !9, line: 1, baseType: !306, size: 64, align: 64, offset: 384)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !9, line: 1, size: 320, align: 8, elements: !308)
!308 = !{!309, !310, !311}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !9, line: 1, baseType: !304, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !9, line: 1, baseType: !304, size: 64, align: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !9, line: 1, baseType: !312, size: 192, align: 64, offset: 128)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !11, size: 192, align: 8, elements: !313)
!313 = !{!314, !321, !322}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !315, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !9, line: 1, size: 320, align: 8, elements: !317)
!317 = !{!309, !310, !318, !319, !320}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !9, line: 1, baseType: !32, size: 64, align: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !9, line: 1, baseType: !32, size: 64, align: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !9, line: 1, baseType: !32, size: 64, align: 64, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !11, line: 1, baseType: !29, size: 64, align: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !11, line: 1, baseType: !29, size: 64, align: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !9, line: 1, baseType: !32, size: 64, align: 64, offset: 448)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !11, line: 6, baseType: !325, size: 64, align: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!328, !32}
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !9, line: 1, size: 128, align: 8, elements: !329)
!329 = !{!330, !339}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !9, line: 1, baseType: !331, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !11, size: 128, align: 8, elements: !333)
!333 = !{!334, !335}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !11, line: 1, baseType: !284, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !11, line: 1, baseType: !336, size: 64, align: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!251, !32}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !9, line: 1, baseType: !32, size: 64, align: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !11, line: 6, baseType: !341, size: 64, align: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!344, !32, !348}
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !11, size: 192, align: 8, elements: !345)
!345 = !{!346, !347}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !11, line: 4, baseType: !29, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !11, line: 4, baseType: !328, size: 128, align: 64, offset: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !11, size: 192, align: 8, elements: !349)
!349 = !{!350, !321, !322}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !254, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !237, line: 1, baseType: !32, size: 64, align: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !237, line: 6, baseType: !353, size: 64, align: 64, offset: 640)
!353 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !237, line: 6, baseType: !355, size: 192, align: 64, offset: 704)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !11, size: 192, align: 8, elements: !356)
!356 = !{!357, !321, !322}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !304, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !237, line: 6, baseType: !14, size: 8, align: 8, offset: 896)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "Uncompressed", file: !237, line: 6, baseType: !14, size: 8, align: 8, offset: 904)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !237, line: 6, baseType: !261, size: 64, align: 64, offset: 960)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "Request", file: !237, line: 6, baseType: !362, size: 64, align: 64, offset: 1024)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !237, line: 6, size: 1984, align: 8, elements: !364)
!364 = !{!365, !366, !257, !258, !259, !260, !276, !385, !397, !398, !399, !400, !401, !402, !403, !409, !410, !411, !412, !613, !616, !617}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !237, line: 6, baseType: !251, size: 128, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "URL", file: !237, line: 6, baseType: !367, size: 64, align: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !237, line: 6, size: 1024, align: 8, elements: !369)
!369 = !{!370, !371, !372, !379, !380, !381, !382, !383, !384}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !237, line: 6, baseType: !251, size: 128, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !237, line: 6, baseType: !251, size: 128, align: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !237, line: 6, baseType: !373, size: 64, align: 64, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !237, line: 6, size: 320, align: 8, elements: !375)
!375 = !{!376, !377, !378}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !237, line: 6, baseType: !251, size: 128, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !237, line: 6, baseType: !251, size: 128, align: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !237, line: 6, baseType: !14, size: 8, align: 8, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !237, line: 6, baseType: !251, size: 128, align: 64, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !237, line: 6, baseType: !251, size: 128, align: 64, offset: 448)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !237, line: 6, baseType: !251, size: 128, align: 64, offset: 576)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !237, line: 6, baseType: !14, size: 8, align: 8, offset: 704)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !237, line: 6, baseType: !251, size: 128, align: 64, offset: 768)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !237, line: 6, baseType: !251, size: 128, align: 64, offset: 896)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "GetBody", file: !237, line: 6, baseType: !386, size: 64, align: 64, offset: 640)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !237, line: 6, size: 64, align: 8, elements: !388)
!388 = !{!389}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !237, line: 6, baseType: !390, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!393}
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ReadCloser,error}", file: !11, size: 256, align: 8, elements: !394)
!394 = !{!395, !396}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !11, line: 6, baseType: !277, size: 128, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !11, line: 6, baseType: !328, size: 128, align: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !237, line: 6, baseType: !353, size: 64, align: 64, offset: 704)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !237, line: 6, baseType: !355, size: 192, align: 64, offset: 768)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !237, line: 6, baseType: !14, size: 8, align: 8, offset: 960)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !237, line: 6, baseType: !251, size: 128, align: 64, offset: 1024)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "Form", file: !237, line: 6, baseType: !261, size: 64, align: 64, offset: 1152)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "PostForm", file: !237, line: 6, baseType: !261, size: 64, align: 64, offset: 1216)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "MultipartForm", file: !237, line: 6, baseType: !404, size: 64, align: 64, offset: 1280)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "Form", file: !237, line: 6, size: 128, align: 8, elements: !406)
!406 = !{!407, !408}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !237, line: 6, baseType: !261, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "File", file: !237, line: 6, baseType: !261, size: 64, align: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !237, line: 6, baseType: !261, size: 64, align: 64, offset: 1344)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !237, line: 6, baseType: !251, size: 128, align: 64, offset: 1408)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "RequestURI", file: !237, line: 6, baseType: !251, size: 128, align: 64, offset: 1536)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !237, line: 6, baseType: !413, size: 64, align: 64, offset: 1664)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConnectionState", file: !237, line: 6, size: 1408, align: 8, elements: !415)
!415 = !{!416, !417, !418, !419, !420, !421, !422, !423, !589, !594, !599, !600, !612}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !237, line: 6, baseType: !268, size: 16, align: 16)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "HandshakeComplete", file: !237, line: 6, baseType: !14, size: 8, align: 8, offset: 16)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "DidResume", file: !237, line: 6, baseType: !14, size: 8, align: 8, offset: 24)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuite", file: !237, line: 6, baseType: !268, size: 16, align: 16, offset: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocol", file: !237, line: 6, baseType: !251, size: 128, align: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocolIsMutual", file: !237, line: 6, baseType: !14, size: 8, align: 8, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !237, line: 6, baseType: !251, size: 128, align: 64, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "PeerCertificates", file: !237, line: 6, baseType: !424, size: 192, align: 64, offset: 384)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Certificate,int,int}", file: !11, size: 192, align: 8, elements: !425)
!425 = !{!426, !321, !322}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !427, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !237, line: 6, size: 10624, align: 8, elements: !430)
!430 = !{!431, !432, !433, !434, !435, !436, !437, !439, !441, !445, !446, !459, !485, !486, !519, !520, !522, !532, !533, !538, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !563, !568, !569, !570, !571, !582, !583, !584, !585, !586, !587, !588}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !237, line: 6, baseType: !348, size: 192, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !237, line: 6, baseType: !348, size: 192, align: 64, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !237, line: 6, baseType: !348, size: 192, align: 64, offset: 384)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !237, line: 6, baseType: !348, size: 192, align: 64, offset: 576)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !237, line: 6, baseType: !348, size: 192, align: 64, offset: 768)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !237, line: 6, baseType: !348, size: 192, align: 64, offset: 960)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !237, line: 6, baseType: !438, size: 64, align: 64, offset: 1152)
!438 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !237, line: 6, baseType: !440, size: 64, align: 64, offset: 1216)
!440 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !237, line: 6, baseType: !442, size: 128, align: 64, offset: 1280)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrivateKey", file: !237, line: 6, size: 128, align: 8, elements: !443)
!443 = !{!444, !351}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !237, line: 1, baseType: !284, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !237, line: 6, baseType: !29, size: 64, align: 64, offset: 1408)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !237, line: 6, baseType: !447, size: 64, align: 64, offset: 1472)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !237, line: 6, size: 256, align: 8, elements: !449)
!449 = !{!450, !451}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !237, line: 6, baseType: !14, size: 8, align: 8)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !237, line: 6, baseType: !452, size: 192, align: 64, offset: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !237, line: 6, size: 192, align: 8, elements: !453)
!453 = !{!454, !457, !458}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !237, line: 1, baseType: !455, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !237, line: 1, baseType: !29, size: 64, align: 64, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !237, line: 1, baseType: !29, size: 64, align: 64, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !237, line: 6, baseType: !460, size: 1984, align: 64, offset: 1536)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !237, line: 6, size: 1984, align: 8, elements: !461)
!461 = !{!462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !484}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !237, line: 6, baseType: !355, size: 192, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !237, line: 6, baseType: !355, size: 192, align: 64, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !237, line: 6, baseType: !355, size: 192, align: 64, offset: 384)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !237, line: 6, baseType: !355, size: 192, align: 64, offset: 576)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !237, line: 6, baseType: !355, size: 192, align: 64, offset: 768)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !237, line: 6, baseType: !355, size: 192, align: 64, offset: 960)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !237, line: 6, baseType: !355, size: 192, align: 64, offset: 1152)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !237, line: 6, baseType: !251, size: 128, align: 64, offset: 1344)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !237, line: 6, baseType: !251, size: 128, align: 64, offset: 1472)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !237, line: 6, baseType: !472, size: 192, align: 64, offset: 1600)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !11, size: 192, align: 8, elements: !473)
!473 = !{!474, !321, !322}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !475, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !237, line: 6, size: 320, align: 8, elements: !477)
!477 = !{!478, !483}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !237, line: 6, baseType: !479, size: 192, align: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !237, line: 6, size: 192, align: 8, elements: !480)
!480 = !{!481, !457, !458}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !237, line: 1, baseType: !482, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !237, line: 6, baseType: !442, size: 128, align: 64, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !237, line: 6, baseType: !472, size: 192, align: 64, offset: 1792)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !237, line: 6, baseType: !460, size: 1984, align: 64, offset: 3520)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !237, line: 6, baseType: !487, size: 192, align: 64, offset: 5504)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !237, line: 6, size: 192, align: 8, elements: !488)
!488 = !{!489, !490, !491}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !237, line: 6, baseType: !23, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !237, line: 6, baseType: !353, size: 64, align: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !237, line: 6, baseType: !492, size: 64, align: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !237, line: 6, size: 704, align: 8, elements: !494)
!494 = !{!495, !496, !505, !516, !517, !518}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !237, line: 6, baseType: !251, size: 128, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !237, line: 6, baseType: !497, size: 192, align: 64, offset: 128)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !11, size: 192, align: 8, elements: !498)
!498 = !{!499, !321, !322}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !500, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !237, line: 6, size: 256, align: 8, elements: !502)
!502 = !{!495, !503, !504}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !237, line: 6, baseType: !29, size: 64, align: 64, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !237, line: 6, baseType: !14, size: 8, align: 8, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !237, line: 6, baseType: !506, size: 192, align: 64, offset: 320)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !11, size: 192, align: 8, elements: !507)
!507 = !{!508, !321, !322}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !509, size: 64, align: 64)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !237, line: 6, size: 128, align: 8, elements: !511)
!511 = !{!512, !513, !514, !515}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !237, line: 6, baseType: !353, size: 64, align: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !237, line: 6, baseType: !17, size: 8, align: 8, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !237, line: 6, baseType: !14, size: 8, align: 8, offset: 72)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !237, line: 6, baseType: !14, size: 8, align: 8, offset: 80)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !237, line: 6, baseType: !353, size: 64, align: 64, offset: 512)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !237, line: 6, baseType: !353, size: 64, align: 64, offset: 576)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !237, line: 6, baseType: !500, size: 64, align: 64, offset: 640)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !237, line: 6, baseType: !487, size: 192, align: 64, offset: 5696)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !237, line: 6, baseType: !521, size: 64, align: 64, offset: 5888)
!521 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !237, line: 6, baseType: !523, size: 192, align: 64, offset: 5952)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !11, size: 192, align: 8, elements: !524)
!524 = !{!525, !321, !322}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !526, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !237, line: 6, size: 448, align: 8, elements: !528)
!528 = !{!529, !530, !531}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !237, line: 6, baseType: !479, size: 192, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !237, line: 6, baseType: !14, size: 8, align: 8, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !237, line: 6, baseType: !348, size: 192, align: 64, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !237, line: 6, baseType: !523, size: 192, align: 64, offset: 6144)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !237, line: 6, baseType: !534, size: 192, align: 64, offset: 6336)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !11, size: 192, align: 8, elements: !535)
!535 = !{!536, !321, !322}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !537, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !237, line: 6, baseType: !539, size: 192, align: 64, offset: 6528)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !11, size: 192, align: 8, elements: !540)
!540 = !{!541, !321, !322}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !542, size: 64, align: 64)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !237, line: 6, baseType: !534, size: 192, align: 64, offset: 6720)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !237, line: 6, baseType: !14, size: 8, align: 8, offset: 6912)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !237, line: 6, baseType: !14, size: 8, align: 8, offset: 6920)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !237, line: 6, baseType: !29, size: 64, align: 64, offset: 6976)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !237, line: 6, baseType: !14, size: 8, align: 8, offset: 7040)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !237, line: 6, baseType: !348, size: 192, align: 64, offset: 7104)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !237, line: 6, baseType: !348, size: 192, align: 64, offset: 7296)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !237, line: 6, baseType: !355, size: 192, align: 64, offset: 7488)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !237, line: 6, baseType: !355, size: 192, align: 64, offset: 7680)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !237, line: 6, baseType: !355, size: 192, align: 64, offset: 7872)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !237, line: 6, baseType: !355, size: 192, align: 64, offset: 8064)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !237, line: 6, baseType: !556, size: 192, align: 64, offset: 8256)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !11, size: 192, align: 8, elements: !557)
!557 = !{!558, !321, !322}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !559, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !237, line: 6, size: 192, align: 8, elements: !561)
!561 = !{!562, !457, !458}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !237, line: 1, baseType: !254, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !237, line: 6, baseType: !564, size: 192, align: 64, offset: 8448)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !11, size: 192, align: 8, elements: !565)
!565 = !{!566, !321, !322}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !567, size: 64, align: 64)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !237, line: 6, baseType: !14, size: 8, align: 8, offset: 8640)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !237, line: 6, baseType: !355, size: 192, align: 64, offset: 8704)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !237, line: 6, baseType: !355, size: 192, align: 64, offset: 8896)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !237, line: 6, baseType: !572, size: 192, align: 64, offset: 9088)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !11, size: 192, align: 8, elements: !573)
!573 = !{!574, !321, !322}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !575, size: 64, align: 64)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !237, line: 6, size: 384, align: 8, elements: !578)
!578 = !{!579, !580}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !237, line: 6, baseType: !560, size: 192, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !237, line: 6, baseType: !581, size: 192, align: 64, offset: 192)
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !237, line: 6, size: 192, align: 8, elements: !561)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !237, line: 6, baseType: !572, size: 192, align: 64, offset: 9280)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !237, line: 6, baseType: !355, size: 192, align: 64, offset: 9472)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !237, line: 6, baseType: !355, size: 192, align: 64, offset: 9664)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !237, line: 6, baseType: !355, size: 192, align: 64, offset: 9856)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !237, line: 6, baseType: !355, size: 192, align: 64, offset: 10048)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !237, line: 6, baseType: !355, size: 192, align: 64, offset: 10240)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !237, line: 6, baseType: !534, size: 192, align: 64, offset: 10432)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "VerifiedChains", file: !237, line: 6, baseType: !590, size: 192, align: 64, offset: 576)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{**Certificate,int,int},int,int}", file: !11, size: 192, align: 8, elements: !591)
!591 = !{!592, !321, !322}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !593, size: 64, align: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !237, line: 6, baseType: !595, size: 192, align: 64, offset: 768)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !11, size: 192, align: 8, elements: !596)
!596 = !{!597, !321, !322}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !598, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPResponse", file: !237, line: 6, baseType: !348, size: 192, align: 64, offset: 960)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ekm", file: !237, line: 6, baseType: !601, size: 64, align: 64, offset: 1152)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !237, line: 6, size: 64, align: 8, elements: !603)
!603 = !{!604}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !237, line: 6, baseType: !605, size: 64, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!608, !251, !348, !29}
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !11, size: 320, align: 8, elements: !609)
!609 = !{!610, !611}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !11, line: 6, baseType: !348, size: 192, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !11, line: 6, baseType: !328, size: 128, align: 64, offset: 192)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "TLSUnique", file: !237, line: 6, baseType: !348, size: 192, align: 64, offset: 1216)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", file: !237, line: 6, baseType: !614, size: 64, align: 64, offset: 1728)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !9, line: 1, align: 8, elements: !5)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Response", file: !237, line: 6, baseType: !32, size: 64, align: 64, offset: 1792)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", file: !237, line: 6, baseType: !618, size: 128, align: 64, offset: 1856)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !237, line: 6, size: 128, align: 8, elements: !619)
!619 = !{!620, !351}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !237, line: 6, baseType: !621, size: 64, align: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void).net/http.http2closeWaiter,*func(*void)error,*func(*void,PrivateKey)PrivateKey}", file: !11, size: 320, align: 8, elements: !623)
!623 = !{!283, !624, !632, !636, !637}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !11, line: 6, baseType: !625, size: 64, align: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!628, !32}
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !11, size: 256, align: 8, elements: !629)
!629 = !{!630, !631}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !11, line: 6, baseType: !487, size: 192, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !11, line: 6, baseType: !14, size: 8, align: 8, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !11, line: 6, baseType: !633, size: 64, align: 64, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!614, !32}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !11, line: 6, baseType: !325, size: 64, align: 64, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !11, line: 6, baseType: !638, size: 64, align: 64, offset: 256)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!442, !32, !442}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !237, line: 6, baseType: !413, size: 64, align: 64, offset: 1088)
!642 = !DILocation(line: 0, scope: !242)
!643 = !DILocalVariable(name: "err", scope: !244, file: !237, line: 11, type: !328)
!644 = !DILocation(line: 12, column: 12, scope: !244)
!645 = !DILocation(line: 15, column: 15, scope: !244)
!646 = !DILocation(line: 13, column: 15, scope: !244)
!647 = !DILocation(line: 13, column: 9, scope: !244)
!648 = !DILocation(line: 15, column: 5, scope: !244)
!649 = !DILocation(line: 17, column: 9, scope: !244)
!650 = !DILocation(line: 19, column: 22, scope: !244)
!651 = !DILocation(line: 0, scope: !652)
!652 = distinct !DILexicalBlock(scope: !244, file: !237, line: 20, column: 5)
!653 = !DILocation(line: 20, column: 24, scope: !652)
!654 = !DILocalVariable(name: "i", scope: !652, file: !237, line: 20, type: !29)
!655 = !DILocation(line: 0, scope: !244)
!656 = !DILocation(line: 21, column: 13, scope: !652)
!657 = !DILocation(line: 21, column: 28, scope: !652)
!658 = !DILocation(line: 20, column: 42, scope: !652)
!659 = !DILocation(line: 20, column: 32, scope: !652)
!660 = !DILocation(line: 24, column: 22, scope: !661)
!661 = distinct !DILexicalBlock(scope: !244, file: !237, line: 24, column: 5)
!662 = !DILocalVariable(name: "err", scope: !661, file: !237, line: 24, type: !328)
!663 = !DILocation(line: 24, column: 34, scope: !661)
!664 = !DILocation(line: 25, column: 15, scope: !661)
!665 = !DILocation(line: 25, column: 9, scope: !661)
!666 = distinct !DISubprogram(name: "main.main..thunk0", scope: null, file: !237, line: 15, type: !667, scopeLine: 15, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !5)
!667 = !DISubroutineType(types: !668)
!668 = !{!14, !669}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ReadCloser}", file: !11, size: 128, align: 8, elements: !671)
!671 = !{!672}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "object", file: !11, line: 15, baseType: !277, size: 128, align: 64)
!673 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !666, file: !237, line: 15, type: !669)
!674 = !DILocation(line: 0, scope: !666)
!675 = !DILocalVariable(name: "$ret2", scope: !666, file: !237, line: 15, type: !14)
!676 = !DILocation(line: 15, column: 5, scope: !666)
!677 = distinct !DISubprogram(name: "main.struct.4runtime.gList.2.runtime.n.0int32.5..eq", linkageName: "main.struct.4runtime.gList.2.runtime.n.0int32.5..eq", scope: null, file: !9, line: 1, type: !300, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!678 = !DILocalVariable(name: "key1", arg: 1, scope: !677, file: !9, line: 1, type: !32)
!679 = !DILocation(line: 0, scope: !677)
!680 = !DILocalVariable(name: "key2", arg: 2, scope: !677, file: !9, line: 1, type: !32)
!681 = !DILocalVariable(name: "$ret3", scope: !677, file: !9, line: 1, type: !14)
!682 = !DILocation(line: 1, column: 1, scope: !677)
!683 = distinct !DISubprogram(name: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", linkageName: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", scope: null, file: !9, line: 1, type: !300, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!684 = !DILocalVariable(name: "key1", arg: 1, scope: !683, file: !9, line: 1, type: !32)
!685 = !DILocation(line: 0, scope: !683)
!686 = !DILocalVariable(name: "key2", arg: 2, scope: !683, file: !9, line: 1, type: !32)
!687 = !DILocalVariable(name: "$ret15", scope: !683, file: !9, line: 1, type: !14)
!688 = !DILocation(line: 1, column: 1, scope: !683)
