; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22cpu\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22internal..z2fcpu..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22sys\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime..z2finternal..z2fsys..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~internal..z2fbytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22atomic\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !5, globals: !6)
!4 = !DIFile(filename: "main-2.go", directory: "/home/usea")
!5 = !{}
!6 = !{!7, !20, !22, !24, !26, !28}
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "internal..z2fcpu..types", linkageName: "internal..z2fcpu..types", scope: !3, file: !9, type: !10, isLocal: false, isDefinition: true)
!9 = !DIFile(filename: "", directory: "")
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,[1]*void}", file: !9, size: 128, align: 8, elements: !11)
!11 = !{!12, !14}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !9, line: 1, baseType: !13, size: 64, align: 64)
!13 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "types", file: !9, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 64, align: 8, elements: !18)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "void")
!18 = !{!19}
!19 = !DISubrange(count: 1, lowerBound: 0)
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "runtime..types", linkageName: "runtime..types", scope: !3, file: !9, type: !10, isLocal: false, isDefinition: true)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "runtime..z2finternal..z2fsys..types", linkageName: "runtime..z2finternal..z2fsys..types", scope: !3, file: !9, type: !10, isLocal: false, isDefinition: true)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "internal..z2fbytealg..types", linkageName: "internal..z2fbytealg..types", scope: !3, file: !9, type: !10, isLocal: false, isDefinition: true)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "runtime..z2finternal..z2fatomic..types", linkageName: "runtime..z2finternal..z2fatomic..types", scope: !3, file: !9, type: !10, isLocal: false, isDefinition: true)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "runtime..z2finternal..z2fmath..types", linkageName: "runtime..z2finternal..z2fmath..types", scope: !3, file: !9, type: !10, isLocal: false, isDefinition: true)
!30 = distinct !DISubprogram(name: "main.__go_init_main", linkageName: "__go_init_main", scope: null, file: !31, line: 1, type: !32, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!31 = !DIFile(filename: "main-2.go", directory: "")
!32 = !DISubroutineType(types: !33)
!33 = !{!17}
!34 = !DILocation(line: 1, column: 1, scope: !35)
!35 = !DILexicalBlockFile(scope: !30, file: !36, discriminator: 0)
!36 = !DIFile(filename: "<built-in>", directory: "")
!37 = distinct !DISubprogram(name: "main.compare", linkageName: "main.compare", scope: null, file: !31, line: 7, type: !38, scopeLine: 7, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !41}
!40 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!41 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!42 = !DILocalVariable(name: "cond", arg: 1, scope: !37, file: !31, line: 7, type: !41)
!43 = !DILocation(line: 7, column: 15, scope: !37)
!44 = !DILocalVariable(name: "$ret0", scope: !37, file: !31, line: 7, type: !40)
!45 = !DILocation(line: 7, column: 26, scope: !37)
!46 = !DILocation(line: 8, column: 2, scope: !37)
!47 = !DILocalVariable(name: "nxt", arg: 1, scope: !48, file: !31, line: 11, type: !40)
!48 = distinct !DISubprogram(name: "main.__VERIFIER_assume", linkageName: "main.__VERIFIER_assume", scope: null, file: !31, line: 11, type: !49, scopeLine: 11, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!49 = !DISubroutineType(types: !50)
!50 = !{!17, !40}
!51 = !DILocation(line: 11, column: 25, scope: !48)
!52 = !DILocalVariable(name: "cond", arg: 1, scope: !53, file: !31, line: 15, type: !41)
!53 = distinct !DISubprogram(name: "main.sassert", linkageName: "main.sassert", scope: null, file: !31, line: 15, type: !54, scopeLine: 15, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!54 = !DISubroutineType(types: !55)
!55 = !{!17, !41}
!56 = !DILocation(line: 15, column: 15, scope: !53)
!57 = distinct !DISubprogram(name: "main.main", linkageName: "main.main", scope: null, file: !31, line: 19, type: !32, scopeLine: 19, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!58 = !DILocalVariable(name: "a", scope: !59, file: !31, line: 20, type: !40)
!59 = distinct !DILexicalBlock(scope: !57, file: !31, line: 19, column: 1)
!60 = !DILocation(line: 20, column: 6, scope: !57)
!61 = !DILocalVariable(name: "b", scope: !59, file: !31, line: 21, type: !40)
!62 = !DILocation(line: 21, column: 6, scope: !57)
!63 = !DILocation(line: 22, column: 28, scope: !59)
!64 = !DILocation(line: 22, column: 30, scope: !59)
!65 = !DILocation(line: 22, column: 20, scope: !59)
!66 = !DILocation(line: 22, column: 2, scope: !59)
!67 = !DILocation(line: 23, column: 28, scope: !59)
!68 = !DILocation(line: 23, column: 30, scope: !59)
!69 = !DILocation(line: 23, column: 20, scope: !59)
!70 = !DILocation(line: 23, column: 2, scope: !59)
!71 = !DILocation(line: 24, column: 10, scope: !59)
!72 = !DILocation(line: 24, column: 12, scope: !59)
!73 = !DILocation(line: 24, column: 19, scope: !59)
!74 = !DILocation(line: 24, column: 23, scope: !59)
!75 = !DILocation(line: 24, column: 21, scope: !59)
!76 = !DILocation(line: 24, column: 17, scope: !59)
!77 = !DILocation(line: 24, column: 2, scope: !59)
!78 = distinct !DISubprogram(name: "main.runtime.pushAll..stub..1struct.4runtime.gList.2.runtime.n.0int32.5", scope: null, file: !31, line: 1, type: !79, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !5)
!79 = !DISubroutineType(types: !80)
!80 = !{!17, !81, !81, !90}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.gList,int32}", file: !9, size: 128, align: 8, elements: !83)
!83 = !{!84, !89}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "gList", file: !9, line: 1, baseType: !85, size: 64, align: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gList", file: !31, line: 1, size: 64, align: 8, elements: !86)
!86 = !{!87}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "head", file: !31, line: 1, baseType: !88, size: 64, align: 64)
!88 = !DIBasicType(name: ".runtime.guintptr", size: 64, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !9, line: 1, baseType: !40, size: 32, align: 32, offset: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gQueue", file: !31, line: 1, size: 128, align: 8, elements: !91)
!91 = !{!87, !92}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "tail", file: !31, line: 1, baseType: !88, size: 64, align: 64, offset: 64)
!93 = !DILocalVariable(name: "$this21", arg: 1, scope: !78, file: !31, line: 1, type: !81)
!94 = !DILocation(line: 1, column: 1, scope: !78)
!95 = !DILocalVariable(name: "$p22", arg: 2, scope: !78, file: !31, line: 1, type: !90)
!96 = distinct !DISubprogram(name: "main.runtime.pop..stub..1struct.4runtime.gList.2.runtime.n.0int32.5", scope: null, file: !31, line: 1, type: !97, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !5)
!97 = !DISubroutineType(types: !98)
!98 = !{!99, !81, !81}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.g", file: !31, line: 1, size: 18816, align: 8, elements: !101)
!101 = !{!102, !164, !177, !340, !341, !342, !343, !344, !345, !346, !347, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !369, !370, !371, !372, !373, !388, !389, !452, !453, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !487, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !31, line: 1, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._panic", file: !31, line: 1, size: 256, align: 8, elements: !105)
!105 = !{!106, !107, !160, !161, !162, !163}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "link", file: !31, line: 1, baseType: !16, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !31, line: 1, baseType: !108, size: 128, align: 64, offset: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !9, size: 128, align: 8, elements: !109)
!109 = !{!110, !159}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 1, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !36, line: 1, size: 512, align: 8, elements: !113)
!113 = !{!114, !116, !117, !119, !121, !122, !123, !124, !132, !134, !140, !158}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !36, line: 1, baseType: !115, size: 64, align: 64)
!115 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !36, line: 1, baseType: !115, size: 64, align: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !36, line: 1, baseType: !118, size: 32, align: 32, offset: 128)
!118 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !36, line: 1, baseType: !120, size: 8, align: 8, offset: 160)
!120 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !36, line: 1, baseType: !120, size: 8, align: 8, offset: 168)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !36, line: 1, baseType: !120, size: 8, align: 8, offset: 176)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !36, line: 1, baseType: !120, size: 8, align: 8, offset: 184)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !36, line: 1, baseType: !125, size: 64, align: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !36, line: 1, size: 64, align: 8, elements: !127)
!127 = !{!128}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !36, line: 1, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!41, !16, !16}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !36, line: 1, baseType: !133, size: 64, align: 64, offset: 256)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !36, line: 1, baseType: !135, size: 64, align: 64, offset: 320)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !36, line: 1, size: 128, align: 8, elements: !137)
!137 = !{!138, !139}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !36, line: 1, baseType: !133, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !36, line: 1, baseType: !13, size: 64, align: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !36, line: 1, baseType: !141, size: 64, align: 64, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !36, line: 1, size: 320, align: 8, elements: !143)
!143 = !{!144, !145, !146}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !36, line: 1, baseType: !135, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !36, line: 1, baseType: !135, size: 64, align: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !36, line: 1, baseType: !147, size: 192, align: 64, offset: 128)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !9, size: 192, align: 8, elements: !148)
!148 = !{!149, !156, !157}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !36, line: 1, size: 320, align: 8, elements: !152)
!152 = !{!144, !145, !153, !154, !155}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !36, line: 1, baseType: !16, size: 64, align: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !36, line: 1, baseType: !16, size: 64, align: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !36, line: 1, baseType: !16, size: 64, align: 64, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !9, line: 1, baseType: !13, size: 64, align: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !9, line: 1, baseType: !13, size: 64, align: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !36, line: 1, baseType: !16, size: 64, align: 64, offset: 448)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !9, line: 1, baseType: !16, size: 64, align: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 200)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "aborted", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 208)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "goexit", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 216)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_defer", file: !31, line: 1, baseType: !165, size: 64, align: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._defer", file: !31, line: 1, size: 512, align: 8, elements: !167)
!167 = !{!106, !168, !170, !171, !172, !173, !174, !175, !176}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "frame", file: !31, line: 1, baseType: !169, size: 64, align: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "panicStack", file: !31, line: 1, baseType: !103, size: 64, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !31, line: 1, baseType: !103, size: 64, align: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "pfn", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 320)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "retaddr", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 384)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "makefunccanrecover", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 448)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "heap", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 456)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !31, line: 1, baseType: !178, size: 64, align: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.m", file: !31, line: 1, size: 15808, align: 8, elements: !180)
!180 = !{!181, !182, !184, !185, !192, !198, !199, !200, !202, !203, !204, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !218, !219, !220, !224, !225, !226, !227, !228, !232, !233, !235, !302, !303, !313, !314, !315, !316, !321, !322, !323, !324, !325, !326, !327, !328, !329, !331, !335, !336, !337, !338, !339}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "g0", file: !31, line: 1, baseType: !16, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "procid", file: !31, line: 1, baseType: !183, size: 64, align: 64, offset: 64)
!183 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "gsignal", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sigmask", file: !31, line: 1, baseType: !186, size: 1024, align: 64, offset: 192)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sigset", file: !31, line: 1, size: 1024, align: 8, elements: !187)
!187 = !{!188}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__val", file: !31, line: 1, baseType: !189, size: 1024, align: 64)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 1024, align: 8, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 16, lowerBound: 0)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "mstartfn", file: !31, line: 1, baseType: !193, size: 64, align: 64, offset: 1216)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !31, line: 1, size: 64, align: 8, elements: !195)
!195 = !{!196}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !31, line: 1, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "curg", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 1280)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "caughtsig", file: !31, line: 1, baseType: !88, size: 64, align: 64, offset: 1344)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "p", file: !31, line: 1, baseType: !201, size: 64, align: 64, offset: 1408)
!201 = !DIBasicType(name: ".runtime.puintptr", size: 64, encoding: DW_ATE_unsigned)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "nextp", file: !31, line: 1, baseType: !201, size: 64, align: 64, offset: 1472)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "oldp", file: !31, line: 1, baseType: !201, size: 64, align: 64, offset: 1536)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "id", file: !31, line: 1, baseType: !205, size: 64, align: 64, offset: 1600)
!205 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mallocing", file: !31, line: 1, baseType: !40, size: 32, align: 32, offset: 1664)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "throwing", file: !31, line: 1, baseType: !40, size: 32, align: 32, offset: 1696)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "preemptoff", file: !31, line: 1, baseType: !136, size: 128, align: 64, offset: 1728)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "locks", file: !31, line: 1, baseType: !40, size: 32, align: 32, offset: 1856)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "softfloat", file: !31, line: 1, baseType: !40, size: 32, align: 32, offset: 1888)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "dying", file: !31, line: 1, baseType: !40, size: 32, align: 32, offset: 1920)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "profilehz", file: !31, line: 1, baseType: !40, size: 32, align: 32, offset: 1952)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "spinning", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 1984)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 1992)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "newSigstack", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 2000)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "printlock", file: !31, line: 1, baseType: !217, size: 8, align: 8, offset: 2008)
!217 = !DIBasicType(name: "int8", size: 8, encoding: DW_ATE_signed)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "incgo", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 2016)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "freeWait", file: !31, line: 1, baseType: !118, size: 32, align: 32, offset: 2048)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "fastrand", file: !31, line: 1, baseType: !221, size: 64, align: 32, offset: 2080)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 64, align: 4, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 2, lowerBound: 0)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "needextram", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 2144)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !31, line: 1, baseType: !120, size: 8, align: 8, offset: 2152)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ncgocall", file: !31, line: 1, baseType: !183, size: 64, align: 64, offset: 2176)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ncgo", file: !31, line: 1, baseType: !40, size: 32, align: 32, offset: 2240)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "park", file: !31, line: 1, baseType: !229, size: 64, align: 64, offset: 2304)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.note", file: !31, line: 1, size: 64, align: 8, elements: !230)
!230 = !{!231}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "key", file: !31, line: 1, baseType: !115, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "alllink", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 2368)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !31, line: 1, baseType: !234, size: 64, align: 64, offset: 2432)
!234 = !DIBasicType(name: ".runtime.muintptr", size: 64, encoding: DW_ATE_unsigned)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "mcache", file: !31, line: 1, baseType: !236, size: 64, align: 64, offset: 2496)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mcache", file: !31, line: 1, size: 13376, align: 8, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !295, !296, !297, !301}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "next_sample", file: !31, line: 1, baseType: !115, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "local_scan", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tiny", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tinyoffset", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "local_tinyallocs", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", file: !31, line: 1, baseType: !245, size: 8576, align: 64, offset: 320)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 8576, align: 8, elements: !293)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mspan", file: !31, line: 1, size: 1088, align: 8, elements: !248)
!248 = !{!249, !250, !251, !257, !258, !259, !261, !262, !263, !264, !267, !268, !269, !271, !272, !273, !275, !280, !281, !282, !283, !284, !285, !287}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !31, line: 1, baseType: !16, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "prev", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "list", file: !31, line: 1, baseType: !252, size: 64, align: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mSpanList", file: !31, line: 1, size: 128, align: 8, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "first", file: !31, line: 1, baseType: !16, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "last", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "startAddr", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "npages", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "manualFreeList", file: !31, line: 1, baseType: !260, size: 64, align: 64, offset: 320)
!260 = !DIBasicType(name: ".runtime.gclinkptr", size: 64, encoding: DW_ATE_unsigned)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "freeindex", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 384)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "nelems", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 448)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "allocCache", file: !31, line: 1, baseType: !183, size: 64, align: 64, offset: 512)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "allocBits", file: !31, line: 1, baseType: !265, size: 64, align: 64, offset: 576)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIBasicType(name: ".runtime.gcBits", size: 8, encoding: DW_ATE_unsigned)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "gcmarkBits", file: !31, line: 1, baseType: !265, size: 64, align: 64, offset: 640)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "sweepgen", file: !31, line: 1, baseType: !118, size: 32, align: 32, offset: 704)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "divMul", file: !31, line: 1, baseType: !270, size: 16, align: 16, offset: 736)
!270 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "baseMask", file: !31, line: 1, baseType: !270, size: 16, align: 16, offset: 752)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "allocCount", file: !31, line: 1, baseType: !270, size: 16, align: 16, offset: 768)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "spanclass", file: !31, line: 1, baseType: !274, size: 8, align: 8, offset: 784)
!274 = !DIBasicType(name: ".runtime.spanClass", size: 8, encoding: DW_ATE_unsigned)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !31, line: 1, baseType: !276, size: 8, align: 8, offset: 792)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mSpanStateBox", file: !31, line: 1, size: 8, align: 1, elements: !277)
!277 = !{!278}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "s", file: !31, line: 1, baseType: !279, size: 8, align: 8)
!279 = !DIBasicType(name: ".runtime.mSpanState", size: 8, encoding: DW_ATE_unsigned)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "needzero", file: !31, line: 1, baseType: !120, size: 8, align: 8, offset: 800)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "divShift", file: !31, line: 1, baseType: !120, size: 8, align: 8, offset: 808)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "divShift2", file: !31, line: 1, baseType: !120, size: 8, align: 8, offset: 816)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 832)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "limit", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 896)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "speciallock", file: !31, line: 1, baseType: !286, size: 64, align: 64, offset: 960)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mutex", file: !31, line: 1, size: 64, align: 8, elements: !230)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "specials", file: !31, line: 1, baseType: !288, size: 64, align: 64, offset: 1024)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.special", file: !31, line: 1, size: 128, align: 8, elements: !290)
!290 = !{!249, !291, !292}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !31, line: 1, baseType: !270, size: 16, align: 16, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !31, line: 1, baseType: !120, size: 8, align: 8, offset: 80)
!293 = !{!294}
!294 = !DISubrange(count: 134, lowerBound: 0)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "local_largefree", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 8896)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "local_nlargefree", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 8960)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "local_nsmallfree", file: !31, line: 1, baseType: !298, size: 4288, align: 64, offset: 9024)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 4288, align: 8, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 67, lowerBound: 0)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "flushGen", file: !31, line: 1, baseType: !118, size: 32, align: 32, offset: 13312)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "lockedg", file: !31, line: 1, baseType: !88, size: 64, align: 64, offset: 2560)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "createstack", file: !31, line: 1, baseType: !304, size: 12288, align: 64, offset: 2624)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 12288, align: 8, elements: !311)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.location", file: !31, line: 1, size: 384, align: 8, elements: !306)
!306 = !{!307, !308, !309, !310}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pc", file: !31, line: 1, baseType: !115, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "filename", file: !31, line: 1, baseType: !136, size: 128, align: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "function", file: !31, line: 1, baseType: !136, size: 128, align: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", file: !31, line: 1, baseType: !13, size: 64, align: 64, offset: 320)
!311 = !{!312}
!312 = !DISubrange(count: 32, lowerBound: 0)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "lockedExt", file: !31, line: 1, baseType: !118, size: 32, align: 32, offset: 14912)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "lockedInt", file: !31, line: 1, baseType: !118, size: 32, align: 32, offset: 14944)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "nextwaitm", file: !31, line: 1, baseType: !234, size: 64, align: 64, offset: 14976)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "waitunlockf", file: !31, line: 1, baseType: !317, size: 64, align: 64, offset: 15040)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !31, line: 1, size: 64, align: 8, elements: !319)
!319 = !{!320}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !31, line: 1, baseType: !129, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "waitlock", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 15104)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceev", file: !31, line: 1, baseType: !120, size: 8, align: 8, offset: 15168)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceskip", file: !31, line: 1, baseType: !13, size: 64, align: 64, offset: 15232)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "startingtrace", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 15296)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "syscalltick", file: !31, line: 1, baseType: !118, size: 32, align: 32, offset: 15328)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "freelink", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 15360)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "preemptGen", file: !31, line: 1, baseType: !118, size: 32, align: 32, offset: 15424)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "signalPending", file: !31, line: 1, baseType: !118, size: 32, align: 32, offset: 15456)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "dlogPerM", file: !31, line: 1, baseType: !330, align: 8, offset: 15488)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.dlogPerM", file: !31, line: 1, align: 1, elements: !5)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "mOS", file: !31, line: 1, baseType: !332, size: 8, align: 8, offset: 15488)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mOS", file: !31, line: 1, size: 8, align: 1, elements: !333)
!333 = !{!334}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "unused", file: !31, line: 1, baseType: !120, size: 8, align: 8)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstack", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 15552)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstacksize", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 15616)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "dropextram", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 15680)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "exiting", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 15688)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "scannote", file: !31, line: 1, baseType: !229, size: 64, align: 64, offset: 15744)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "syscallsp", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "syscallpc", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 256)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "param", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 320)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "atomicstatus", file: !31, line: 1, baseType: !118, size: 32, align: 32, offset: 384)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !31, line: 1, baseType: !205, size: 64, align: 64, offset: 448)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !31, line: 1, baseType: !88, size: 64, align: 64, offset: 512)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "waitsince", file: !31, line: 1, baseType: !205, size: 64, align: 64, offset: 576)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "waitreason", file: !31, line: 1, baseType: !348, size: 8, align: 8, offset: 640)
!348 = !DIBasicType(name: ".runtime.waitReason", size: 8, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 648)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "preemptStop", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 656)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "asyncSafePoint", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 664)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "paniconfault", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 672)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "preemptscan", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 680)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "gcscandone", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 688)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "throwsplit", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 696)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "gcScannedSyscallStack", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 704)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "activeStackChans", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 712)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "raceignore", file: !31, line: 1, baseType: !217, size: 8, align: 8, offset: 720)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "sysblocktraced", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 728)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "sysexitticks", file: !31, line: 1, baseType: !205, size: 64, align: 64, offset: 768)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "traceseq", file: !31, line: 1, baseType: !183, size: 64, align: 64, offset: 832)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tracelastp", file: !31, line: 1, baseType: !201, size: 64, align: 64, offset: 896)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "lockedm", file: !31, line: 1, baseType: !234, size: 64, align: 64, offset: 960)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "sig", file: !31, line: 1, baseType: !118, size: 32, align: 32, offset: 1024)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "writebuf", file: !31, line: 1, baseType: !366, size: 192, align: 64, offset: 1088)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !9, size: 192, align: 8, elements: !367)
!367 = !{!368, !156, !157}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !133, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode0", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 1280)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode1", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 1344)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "sigpc", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 1408)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 1472)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ancestors", file: !31, line: 1, baseType: !374, size: 64, align: 64, offset: 1536)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.ancestorInfo,int,int}", file: !9, size: 192, align: 8, elements: !376)
!376 = !{!377, !156, !157}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.ancestorInfo", file: !31, line: 1, size: 320, align: 8, elements: !380)
!380 = !{!381, !386, !387}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "pcs", file: !31, line: 1, baseType: !382, size: 192, align: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uintptr,int,int}", file: !9, size: 192, align: 8, elements: !383)
!383 = !{!384, !156, !157}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !385, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !31, line: 1, baseType: !205, size: 64, align: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 1600)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", file: !31, line: 1, baseType: !390, size: 64, align: 64, offset: 1664)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sudog", file: !31, line: 1, size: 768, align: 8, elements: !392)
!392 = !{!393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !31, line: 1, baseType: !16, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "isSelect", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "prev", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "elem", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "acquiretime", file: !31, line: 1, baseType: !205, size: 64, align: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "releasetime", file: !31, line: 1, baseType: !205, size: 64, align: 64, offset: 384)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ticket", file: !31, line: 1, baseType: !118, size: 32, align: 32, offset: 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "parent", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "waitlink", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 576)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "waittail", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 640)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "c", file: !31, line: 1, baseType: !405, size: 64, align: 64, offset: 704)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.hchan", file: !31, line: 1, size: 768, align: 8, elements: !407)
!407 = !{!408, !410, !411, !412, !413, !414, !446, !447, !448, !450, !451}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "qcount", file: !31, line: 1, baseType: !409, size: 64, align: 64)
!409 = !DIBasicType(name: "uint", size: 64, encoding: DW_ATE_unsigned)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "dataqsiz", file: !31, line: 1, baseType: !409, size: 64, align: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", file: !31, line: 1, baseType: !270, size: 16, align: 16, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "closed", file: !31, line: 1, baseType: !118, size: 32, align: 32, offset: 224)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "elemtype", file: !31, line: 1, baseType: !415, size: 64, align: 64, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._type", file: !31, line: 1, size: 512, align: 8, elements: !417)
!417 = !{!418, !419, !420, !421, !423, !424, !425, !426, !427, !428, !429, !445}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !31, line: 1, baseType: !115, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !31, line: 1, baseType: !118, size: 32, align: 32, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !31, line: 1, baseType: !422, size: 8, align: 8, offset: 160)
!422 = !DIBasicType(name: ".runtime.tflag", size: 8, encoding: DW_ATE_unsigned)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !31, line: 1, baseType: !120, size: 8, align: 8, offset: 168)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !31, line: 1, baseType: !120, size: 8, align: 8, offset: 176)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !31, line: 1, baseType: !120, size: 8, align: 8, offset: 184)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !31, line: 1, baseType: !317, size: 64, align: 64, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !31, line: 1, baseType: !133, size: 64, align: 64, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_string", file: !31, line: 1, baseType: !135, size: 64, align: 64, offset: 320)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "uncommontype", file: !31, line: 1, baseType: !430, size: 64, align: 64, offset: 384)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.uncommontype", file: !31, line: 1, size: 320, align: 8, elements: !432)
!432 = !{!433, !434, !435}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !31, line: 1, baseType: !135, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !31, line: 1, baseType: !135, size: 64, align: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !31, line: 1, baseType: !436, size: 192, align: 64, offset: 128)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.method,int,int}", file: !9, size: 192, align: 8, elements: !437)
!437 = !{!438, !156, !157}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.method", file: !31, line: 1, size: 320, align: 8, elements: !441)
!441 = !{!433, !434, !442, !443, !444}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 448)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "sendx", file: !31, line: 1, baseType: !409, size: 64, align: 64, offset: 320)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "recvx", file: !31, line: 1, baseType: !409, size: 64, align: 64, offset: 384)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "recvq", file: !31, line: 1, baseType: !449, size: 128, align: 64, offset: 448)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.waitq", file: !31, line: 1, size: 128, align: 8, elements: !254)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "sendq", file: !31, line: 1, baseType: !449, size: 128, align: 64, offset: 576)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !31, line: 1, baseType: !286, size: 64, align: 64, offset: 704)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "labels", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 1728)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "timer", file: !31, line: 1, baseType: !454, size: 64, align: 64, offset: 1792)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.timer", file: !31, line: 1, size: 576, align: 8, elements: !456)
!456 = !{!457, !458, !459, !460, !468, !469, !470, !471}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "pp", file: !31, line: 1, baseType: !201, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !31, line: 1, baseType: !205, size: 64, align: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "period", file: !31, line: 1, baseType: !205, size: 64, align: 64, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "f", file: !31, line: 1, baseType: !461, size: 64, align: 64, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !31, line: 1, size: 64, align: 8, elements: !463)
!463 = !{!464}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !31, line: 1, baseType: !465, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!17, !108, !115}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !31, line: 1, baseType: !108, size: 128, align: 64, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 384)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "nextwhen", file: !31, line: 1, baseType: !205, size: 64, align: 64, offset: 448)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "status", file: !31, line: 1, baseType: !118, size: 32, align: 32, offset: 512)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "selectDone", file: !31, line: 1, baseType: !118, size: 32, align: 32, offset: 1856)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "gcAssistBytes", file: !31, line: 1, baseType: !205, size: 64, align: 64, offset: 1920)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "exception", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 1984)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 2048)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "gcstack", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 2112)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "gcstacksize", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 2176)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsegment", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 2240)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 2304)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 2368)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp2", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 2432)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp2", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 2496)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "gcregs", file: !31, line: 1, baseType: !484, size: 7552, align: 64, offset: 2560)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 7552, align: 8, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 118, lowerBound: 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "entry", file: !31, line: 1, baseType: !488, size: 64, align: 64, offset: 10112)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !31, line: 1, size: 64, align: 8, elements: !490)
!490 = !{!491}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !31, line: 1, baseType: !492, size: 64, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!17, !16}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "entryfn", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 10176)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "entrysp", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 10240)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "fromgogo", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 10304)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "scanningself", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 10312)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "scang", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 10368)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "scangcw", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 10432)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "isSystemGoroutine", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 10496)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "isFinalizerGoroutine", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 10504)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "deferring", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 10512)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "goexiting", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 10520)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ranCgocallBackDone", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 10528)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !31, line: 1, baseType: !115, size: 64, align: 64, offset: 10560)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "context", file: !31, line: 1, baseType: !484, size: 7552, align: 64, offset: 10624)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "stackcontext", file: !31, line: 1, baseType: !509, size: 640, align: 64, offset: 18176)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 640, align: 8, elements: !510)
!510 = !{!511}
!511 = !DISubrange(count: 10, lowerBound: 0)
!512 = !DILocalVariable(name: "$this23", arg: 1, scope: !96, file: !31, line: 1, type: !81)
!513 = !DILocation(line: 1, column: 1, scope: !96)
!514 = !DILocalVariable(name: "$ret1", scope: !96, file: !31, line: 1, type: !99)
!515 = distinct !DISubprogram(name: "main.runtime.push..stub..1struct.4runtime.gList.2.runtime.n.0int32.5", scope: null, file: !31, line: 1, type: !516, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !5)
!516 = !DISubroutineType(types: !517)
!517 = !{!17, !81, !81, !99}
!518 = !DILocalVariable(name: "$this24", arg: 1, scope: !515, file: !31, line: 1, type: !81)
!519 = !DILocation(line: 1, column: 1, scope: !515)
!520 = !DILocalVariable(name: "$p25", arg: 2, scope: !515, file: !31, line: 1, type: !99)
!521 = distinct !DISubprogram(name: "main.runtime.empty..stub..1struct.4runtime.gList.2.runtime.n.0int32.5", scope: null, file: !31, line: 1, type: !522, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !5)
!522 = !DISubroutineType(types: !523)
!523 = !{!41, !81, !81}
!524 = !DILocalVariable(name: "$this26", arg: 1, scope: !521, file: !31, line: 1, type: !81)
!525 = !DILocation(line: 1, column: 1, scope: !521)
!526 = !DILocalVariable(name: "$ret2", scope: !521, file: !31, line: 1, type: !41)
!527 = distinct !DISubprogram(name: "main.struct.4runtime.gList.2.runtime.n.0int32.5..eq", linkageName: "main.struct.4runtime.gList.2.runtime.n.0int32.5..eq", scope: null, file: !36, line: 1, type: !130, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!528 = !DILocalVariable(name: "key1", arg: 1, scope: !527, file: !36, line: 1, type: !16)
!529 = !DILocation(line: 1, column: 1, scope: !527)
!530 = !DILocalVariable(name: "key2", arg: 2, scope: !527, file: !36, line: 1, type: !16)
!531 = !DILocalVariable(name: "$ret3", scope: !527, file: !36, line: 1, type: !41)
!532 = distinct !DISubprogram(name: "main.eq", scope: null, file: !36, line: 1, type: !130, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !5)
!533 = !DILocalVariable(name: "key1", arg: 1, scope: !532, file: !36, line: 1, type: !16)
!534 = !DILocation(line: 1, column: 1, scope: !532)
!535 = !DILocalVariable(name: "key2", arg: 2, scope: !532, file: !36, line: 1, type: !16)
!536 = !DILocalVariable(name: "$ret4", scope: !532, file: !36, line: 1, type: !41)
!537 = distinct !DISubprogram(name: "main.eq", scope: null, file: !36, line: 1, type: !130, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !5)
!538 = !DILocalVariable(name: "key1", arg: 1, scope: !537, file: !36, line: 1, type: !16)
!539 = !DILocation(line: 1, column: 1, scope: !537)
!540 = !DILocalVariable(name: "key2", arg: 2, scope: !537, file: !36, line: 1, type: !16)
!541 = !DILocalVariable(name: "$ret5", scope: !537, file: !36, line: 1, type: !41)
!542 = distinct !DISubprogram(name: "main.eq", scope: null, file: !36, line: 1, type: !130, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !5)
!543 = !DILocalVariable(name: "key1", arg: 1, scope: !542, file: !36, line: 1, type: !16)
!544 = !DILocation(line: 1, column: 1, scope: !542)
!545 = !DILocalVariable(name: "key2", arg: 2, scope: !542, file: !36, line: 1, type: !16)
!546 = !DILocalVariable(name: "$ret6", scope: !542, file: !36, line: 1, type: !41)
!547 = distinct !DISubprogram(name: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", linkageName: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", scope: null, file: !36, line: 1, type: !130, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
