; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22init\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22cpu\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22internal..z2fcpu..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22sys\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22runtime..z2finternal..z2fsys..import\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22~internal..z2fbytealg\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22atomic\22"
module asm "\09.ascii \22 \22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !5, globals: !6)
!4 = !DIFile(filename: "main.go", directory: "/codes")
!5 = !{}
!6 = !{!7, !20, !22, !24, !26, !28}
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "internal..z2fcpu..types", linkageName: "internal..z2fcpu..types", scope: !3, file: !9, type: !10, isLocal: false, isDefinition: true)
!9 = !DIFile(filename: "", directory: "")
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,[1]*void}", file: !9, size: 128, align: 8, elements: !11)
!11 = !{!12, !14}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !9, line: 1, baseType: !13, size: 64, align: 64)
!13 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "types", file: !9, line: 1, baseType: !15, size: 64, align: 64, offset: 64)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 64, align: 8, elements: !18)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "void")
!18 = !{!19}
!19 = !DISubrange(count: 1, lowerBound: 0)
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "runtime..types", linkageName: "runtime..types", scope: !3, file: !9, type: !10, isLocal: false, isDefinition: true)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "runtime..z2finternal..z2fsys..types", linkageName: "runtime..z2finternal..z2fsys..types", scope: !3, file: !9, type: !10, isLocal: false, isDefinition: true)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "internal..z2fbytealg..types", linkageName: "internal..z2fbytealg..types", scope: !3, file: !9, type: !10, isLocal: false, isDefinition: true)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "runtime..z2finternal..z2fatomic..types", linkageName: "runtime..z2finternal..z2fatomic..types", scope: !3, file: !9, type: !10, isLocal: false, isDefinition: true)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "runtime..z2finternal..z2fmath..types", linkageName: "runtime..z2finternal..z2fmath..types", scope: !3, file: !9, type: !10, isLocal: false, isDefinition: true)
!30 = distinct !DISubprogram(name: "main.__go_init_main", linkageName: "__go_init_main", scope: null, file: !31, line: 1, type: !32, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!31 = !DIFile(filename: "main.go", directory: "")
!32 = !DISubroutineType(types: !33)
!33 = !{!17}
!34 = !DILocation(line: 1, column: 1, scope: !35)
!35 = !DILexicalBlockFile(scope: !30, file: !36, discriminator: 0)
!36 = !DIFile(filename: "<built-in>", directory: "")
!37 = distinct !DISubprogram(name: "main.compare", linkageName: "main.compare", scope: null, file: !31, line: 7, type: !38, scopeLine: 7, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !41}
!40 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!41 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!42 = !DILocalVariable(name: "cond", arg: 1, scope: !37, file: !31, line: 7, type: !41)
!43 = !DILocation(line: 7, column: 15, scope: !37)
!44 = !DILocalVariable(name: "$ret0", scope: !37, file: !31, line: 7, type: !40)
!45 = !DILocation(line: 7, column: 26, scope: !37)
!46 = !DILocation(line: 8, column: 2, scope: !37)
!47 = !DILocalVariable(name: "nxt", arg: 1, scope: !48, file: !31, line: 11, type: !40)
!48 = distinct !DISubprogram(name: "main.__VERIFIER_assume", linkageName: "main.__VERIFIER_assume", scope: null, file: !31, line: 11, type: !49, scopeLine: 11, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!49 = !DISubroutineType(types: !50)
!50 = !{!17, !40}
!51 = !DILocation(line: 11, column: 25, scope: !48)
!52 = !DILocalVariable(name: "cond", arg: 1, scope: !53, file: !31, line: 15, type: !41)
!53 = distinct !DISubprogram(name: "main.sassert", linkageName: "main.sassert", scope: null, file: !31, line: 15, type: !54, scopeLine: 15, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!54 = !DISubroutineType(types: !55)
!55 = !{!17, !41}
!56 = !DILocation(line: 15, column: 15, scope: !53)
!57 = distinct !DISubprogram(name: "main.main", linkageName: "main.main", scope: null, file: !31, line: 19, type: !32, scopeLine: 19, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!58 = !DILocalVariable(name: "a", scope: !59, file: !31, line: 20, type: !40)
!59 = distinct !DILexicalBlock(scope: !57, file: !31, line: 19, column: 1)
!60 = !DILocation(line: 20, column: 6, scope: !57)
!61 = !DILocation(line: 21, column: 28, scope: !59)
!62 = !DILocation(line: 21, column: 30, scope: !59)
!63 = !DILocation(line: 21, column: 20, scope: !59)
!64 = !DILocation(line: 21, column: 2, scope: !59)
!65 = !DILocation(line: 22, column: 10, scope: !59)
!66 = !DILocation(line: 22, column: 12, scope: !59)
!67 = !DILocation(line: 22, column: 19, scope: !59)
!68 = !DILocation(line: 22, column: 17, scope: !59)
!69 = !DILocation(line: 22, column: 2, scope: !59)
!70 = distinct !DISubprogram(name: "main.runtime.pushAll..stub..1struct.4runtime.gList.2.runtime.n.0int32.5", scope: null, file: !31, line: 1, type: !71, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !5)
!71 = !DISubroutineType(types: !72)
!72 = !{!17, !73, !73, !82}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{.runtime.gList,int32}", file: !9, size: 128, align: 8, elements: !75)
!75 = !{!76, !81}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "gList", file: !9, line: 1, baseType: !77, size: 64, align: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gList", file: !31, line: 1, size: 64, align: 8, elements: !78)
!78 = !{!79}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "head", file: !31, line: 1, baseType: !80, size: 64, align: 64)
!80 = !DIBasicType(name: ".runtime.guintptr", size: 64, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !9, line: 1, baseType: !40, size: 32, align: 32, offset: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.gQueue", file: !31, line: 1, size: 128, align: 8, elements: !83)
!83 = !{!79, !84}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tail", file: !31, line: 1, baseType: !80, size: 64, align: 64, offset: 64)
!85 = !DILocalVariable(name: "$this21", arg: 1, scope: !70, file: !31, line: 1, type: !73)
!86 = !DILocation(line: 1, column: 1, scope: !70)
!87 = !DILocalVariable(name: "$p22", arg: 2, scope: !70, file: !31, line: 1, type: !82)
!88 = distinct !DISubprogram(name: "main.runtime.pop..stub..1struct.4runtime.gList.2.runtime.n.0int32.5", scope: null, file: !31, line: 1, type: !89, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !5)
!89 = !DISubroutineType(types: !90)
!90 = !{!91, !73, !73}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.g", file: !31, line: 1, size: 18816, align: 8, elements: !93)
!93 = !{!94, !156, !169, !332, !333, !334, !335, !336, !337, !338, !339, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !361, !362, !363, !364, !365, !380, !381, !444, !445, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !479, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !31, line: 1, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._panic", file: !31, line: 1, size: 256, align: 8, elements: !97)
!97 = !{!98, !99, !152, !153, !154, !155}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "link", file: !31, line: 1, baseType: !16, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !31, line: 1, baseType: !100, size: 128, align: 64, offset: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*void}", file: !9, size: 128, align: 8, elements: !101)
!101 = !{!102, !151}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !9, line: 1, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !36, line: 1, size: 512, align: 8, elements: !105)
!105 = !{!106, !108, !109, !111, !113, !114, !115, !116, !124, !126, !132, !150}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !36, line: 1, baseType: !107, size: 64, align: 64)
!107 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !36, line: 1, baseType: !107, size: 64, align: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !36, line: 1, baseType: !110, size: 32, align: 32, offset: 128)
!110 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !36, line: 1, baseType: !112, size: 8, align: 8, offset: 160)
!112 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !36, line: 1, baseType: !112, size: 8, align: 8, offset: 168)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !36, line: 1, baseType: !112, size: 8, align: 8, offset: 176)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !36, line: 1, baseType: !112, size: 8, align: 8, offset: 184)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !36, line: 1, baseType: !117, size: 64, align: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !36, line: 1, size: 64, align: 8, elements: !119)
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !36, line: 1, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!41, !16, !16}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !36, line: 1, baseType: !125, size: 64, align: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !36, line: 1, baseType: !127, size: 64, align: 64, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !36, line: 1, size: 128, align: 8, elements: !129)
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !36, line: 1, baseType: !125, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !36, line: 1, baseType: !13, size: 64, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !36, line: 1, baseType: !133, size: 64, align: 64, offset: 384)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !36, line: 1, size: 320, align: 8, elements: !135)
!135 = !{!136, !137, !138}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !36, line: 1, baseType: !127, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !36, line: 1, baseType: !127, size: 64, align: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !36, line: 1, baseType: !139, size: 192, align: 64, offset: 128)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !9, size: 192, align: 8, elements: !140)
!140 = !{!141, !148, !149}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !36, line: 1, size: 320, align: 8, elements: !144)
!144 = !{!136, !137, !145, !146, !147}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !36, line: 1, baseType: !16, size: 64, align: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !36, line: 1, baseType: !16, size: 64, align: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !36, line: 1, baseType: !16, size: 64, align: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !9, line: 1, baseType: !13, size: 64, align: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !9, line: 1, baseType: !13, size: 64, align: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !36, line: 1, baseType: !16, size: 64, align: 64, offset: 448)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !9, line: 1, baseType: !16, size: 64, align: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 200)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "aborted", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 208)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "goexit", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_defer", file: !31, line: 1, baseType: !157, size: 64, align: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._defer", file: !31, line: 1, size: 512, align: 8, elements: !159)
!159 = !{!98, !160, !162, !163, !164, !165, !166, !167, !168}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "frame", file: !31, line: 1, baseType: !161, size: 64, align: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "panicStack", file: !31, line: 1, baseType: !95, size: 64, align: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_panic", file: !31, line: 1, baseType: !95, size: 64, align: 64, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "pfn", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 320)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "retaddr", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 384)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "makefunccanrecover", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 448)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "heap", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 456)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !31, line: 1, baseType: !170, size: 64, align: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.m", file: !31, line: 1, size: 15808, align: 8, elements: !172)
!172 = !{!173, !174, !176, !177, !184, !190, !191, !192, !194, !195, !196, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !210, !211, !212, !216, !217, !218, !219, !220, !224, !225, !227, !294, !295, !305, !306, !307, !308, !313, !314, !315, !316, !317, !318, !319, !320, !321, !323, !327, !328, !329, !330, !331}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "g0", file: !31, line: 1, baseType: !16, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "procid", file: !31, line: 1, baseType: !175, size: 64, align: 64, offset: 64)
!175 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "gsignal", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "sigmask", file: !31, line: 1, baseType: !178, size: 1024, align: 64, offset: 192)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sigset", file: !31, line: 1, size: 1024, align: 8, elements: !179)
!179 = !{!180}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "__val", file: !31, line: 1, baseType: !181, size: 1024, align: 64)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 1024, align: 8, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 16, lowerBound: 0)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "mstartfn", file: !31, line: 1, baseType: !185, size: 64, align: 64, offset: 1216)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !31, line: 1, size: 64, align: 8, elements: !187)
!187 = !{!188}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !31, line: 1, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "curg", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 1280)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "caughtsig", file: !31, line: 1, baseType: !80, size: 64, align: 64, offset: 1344)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "p", file: !31, line: 1, baseType: !193, size: 64, align: 64, offset: 1408)
!193 = !DIBasicType(name: ".runtime.puintptr", size: 64, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "nextp", file: !31, line: 1, baseType: !193, size: 64, align: 64, offset: 1472)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "oldp", file: !31, line: 1, baseType: !193, size: 64, align: 64, offset: 1536)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "id", file: !31, line: 1, baseType: !197, size: 64, align: 64, offset: 1600)
!197 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "mallocing", file: !31, line: 1, baseType: !40, size: 32, align: 32, offset: 1664)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "throwing", file: !31, line: 1, baseType: !40, size: 32, align: 32, offset: 1696)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "preemptoff", file: !31, line: 1, baseType: !128, size: 128, align: 64, offset: 1728)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "locks", file: !31, line: 1, baseType: !40, size: 32, align: 32, offset: 1856)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "softfloat", file: !31, line: 1, baseType: !40, size: 32, align: 32, offset: 1888)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "dying", file: !31, line: 1, baseType: !40, size: 32, align: 32, offset: 1920)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "profilehz", file: !31, line: 1, baseType: !40, size: 32, align: 32, offset: 1952)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "spinning", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 1984)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 1992)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "newSigstack", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 2000)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "printlock", file: !31, line: 1, baseType: !209, size: 8, align: 8, offset: 2008)
!209 = !DIBasicType(name: "int8", size: 8, encoding: DW_ATE_signed)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "incgo", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 2016)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "freeWait", file: !31, line: 1, baseType: !110, size: 32, align: 32, offset: 2048)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "fastrand", file: !31, line: 1, baseType: !213, size: 64, align: 32, offset: 2080)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 64, align: 4, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 2, lowerBound: 0)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "needextram", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 2144)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !31, line: 1, baseType: !112, size: 8, align: 8, offset: 2152)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ncgocall", file: !31, line: 1, baseType: !175, size: 64, align: 64, offset: 2176)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ncgo", file: !31, line: 1, baseType: !40, size: 32, align: 32, offset: 2240)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "park", file: !31, line: 1, baseType: !221, size: 64, align: 64, offset: 2304)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.note", file: !31, line: 1, size: 64, align: 8, elements: !222)
!222 = !{!223}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "key", file: !31, line: 1, baseType: !107, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "alllink", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 2368)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !31, line: 1, baseType: !226, size: 64, align: 64, offset: 2432)
!226 = !DIBasicType(name: ".runtime.muintptr", size: 64, encoding: DW_ATE_unsigned)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "mcache", file: !31, line: 1, baseType: !228, size: 64, align: 64, offset: 2496)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mcache", file: !31, line: 1, size: 13376, align: 8, elements: !230)
!230 = !{!231, !232, !233, !234, !235, !236, !287, !288, !289, !293}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "next_sample", file: !31, line: 1, baseType: !107, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "local_scan", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tiny", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tinyoffset", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "local_tinyallocs", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", file: !31, line: 1, baseType: !237, size: 8576, align: 64, offset: 320)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 8576, align: 8, elements: !285)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mspan", file: !31, line: 1, size: 1088, align: 8, elements: !240)
!240 = !{!241, !242, !243, !249, !250, !251, !253, !254, !255, !256, !259, !260, !261, !263, !264, !265, !267, !272, !273, !274, !275, !276, !277, !279}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !31, line: 1, baseType: !16, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "prev", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "list", file: !31, line: 1, baseType: !244, size: 64, align: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mSpanList", file: !31, line: 1, size: 128, align: 8, elements: !246)
!246 = !{!247, !248}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "first", file: !31, line: 1, baseType: !16, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "last", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "startAddr", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "npages", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "manualFreeList", file: !31, line: 1, baseType: !252, size: 64, align: 64, offset: 320)
!252 = !DIBasicType(name: ".runtime.gclinkptr", size: 64, encoding: DW_ATE_unsigned)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "freeindex", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "nelems", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "allocCache", file: !31, line: 1, baseType: !175, size: 64, align: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "allocBits", file: !31, line: 1, baseType: !257, size: 64, align: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIBasicType(name: ".runtime.gcBits", size: 8, encoding: DW_ATE_unsigned)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "gcmarkBits", file: !31, line: 1, baseType: !257, size: 64, align: 64, offset: 640)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "sweepgen", file: !31, line: 1, baseType: !110, size: 32, align: 32, offset: 704)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "divMul", file: !31, line: 1, baseType: !262, size: 16, align: 16, offset: 736)
!262 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "baseMask", file: !31, line: 1, baseType: !262, size: 16, align: 16, offset: 752)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "allocCount", file: !31, line: 1, baseType: !262, size: 16, align: 16, offset: 768)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "spanclass", file: !31, line: 1, baseType: !266, size: 8, align: 8, offset: 784)
!266 = !DIBasicType(name: ".runtime.spanClass", size: 8, encoding: DW_ATE_unsigned)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !31, line: 1, baseType: !268, size: 8, align: 8, offset: 792)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mSpanStateBox", file: !31, line: 1, size: 8, align: 1, elements: !269)
!269 = !{!270}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "s", file: !31, line: 1, baseType: !271, size: 8, align: 8)
!271 = !DIBasicType(name: ".runtime.mSpanState", size: 8, encoding: DW_ATE_unsigned)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "needzero", file: !31, line: 1, baseType: !112, size: 8, align: 8, offset: 800)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "divShift", file: !31, line: 1, baseType: !112, size: 8, align: 8, offset: 808)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "divShift2", file: !31, line: 1, baseType: !112, size: 8, align: 8, offset: 816)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 832)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "limit", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 896)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "speciallock", file: !31, line: 1, baseType: !278, size: 64, align: 64, offset: 960)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mutex", file: !31, line: 1, size: 64, align: 8, elements: !222)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "specials", file: !31, line: 1, baseType: !280, size: 64, align: 64, offset: 1024)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.special", file: !31, line: 1, size: 128, align: 8, elements: !282)
!282 = !{!241, !283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !31, line: 1, baseType: !262, size: 16, align: 16, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !31, line: 1, baseType: !112, size: 8, align: 8, offset: 80)
!285 = !{!286}
!286 = !DISubrange(count: 134, lowerBound: 0)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "local_largefree", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 8896)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "local_nlargefree", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 8960)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "local_nsmallfree", file: !31, line: 1, baseType: !290, size: 4288, align: 64, offset: 9024)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 4288, align: 8, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 67, lowerBound: 0)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "flushGen", file: !31, line: 1, baseType: !110, size: 32, align: 32, offset: 13312)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "lockedg", file: !31, line: 1, baseType: !80, size: 64, align: 64, offset: 2560)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "createstack", file: !31, line: 1, baseType: !296, size: 12288, align: 64, offset: 2624)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 12288, align: 8, elements: !303)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.location", file: !31, line: 1, size: 384, align: 8, elements: !298)
!298 = !{!299, !300, !301, !302}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pc", file: !31, line: 1, baseType: !107, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "filename", file: !31, line: 1, baseType: !128, size: 128, align: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "function", file: !31, line: 1, baseType: !128, size: 128, align: 64, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", file: !31, line: 1, baseType: !13, size: 64, align: 64, offset: 320)
!303 = !{!304}
!304 = !DISubrange(count: 32, lowerBound: 0)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "lockedExt", file: !31, line: 1, baseType: !110, size: 32, align: 32, offset: 14912)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "lockedInt", file: !31, line: 1, baseType: !110, size: 32, align: 32, offset: 14944)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "nextwaitm", file: !31, line: 1, baseType: !226, size: 64, align: 64, offset: 14976)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "waitunlockf", file: !31, line: 1, baseType: !309, size: 64, align: 64, offset: 15040)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !31, line: 1, size: 64, align: 8, elements: !311)
!311 = !{!312}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !31, line: 1, baseType: !121, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "waitlock", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 15104)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceev", file: !31, line: 1, baseType: !112, size: 8, align: 8, offset: 15168)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "waittraceskip", file: !31, line: 1, baseType: !13, size: 64, align: 64, offset: 15232)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "startingtrace", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 15296)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "syscalltick", file: !31, line: 1, baseType: !110, size: 32, align: 32, offset: 15328)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "freelink", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 15360)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "preemptGen", file: !31, line: 1, baseType: !110, size: 32, align: 32, offset: 15424)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "signalPending", file: !31, line: 1, baseType: !110, size: 32, align: 32, offset: 15456)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "dlogPerM", file: !31, line: 1, baseType: !322, align: 8, offset: 15488)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.dlogPerM", file: !31, line: 1, align: 1, elements: !5)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "mOS", file: !31, line: 1, baseType: !324, size: 8, align: 8, offset: 15488)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.mOS", file: !31, line: 1, size: 8, align: 1, elements: !325)
!325 = !{!326}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "unused", file: !31, line: 1, baseType: !112, size: 8, align: 8)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstack", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 15552)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "gsignalstacksize", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 15616)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "dropextram", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 15680)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "exiting", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 15688)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "scannote", file: !31, line: 1, baseType: !221, size: 64, align: 64, offset: 15744)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "syscallsp", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "syscallpc", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "param", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "atomicstatus", file: !31, line: 1, baseType: !110, size: 32, align: 32, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !31, line: 1, baseType: !197, size: 64, align: 64, offset: 448)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "schedlink", file: !31, line: 1, baseType: !80, size: 64, align: 64, offset: 512)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "waitsince", file: !31, line: 1, baseType: !197, size: 64, align: 64, offset: 576)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "waitreason", file: !31, line: 1, baseType: !340, size: 8, align: 8, offset: 640)
!340 = !DIBasicType(name: ".runtime.waitReason", size: 8, encoding: DW_ATE_unsigned)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 648)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "preemptStop", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 656)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "asyncSafePoint", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 664)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "paniconfault", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 672)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "preemptscan", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 680)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "gcscandone", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 688)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "throwsplit", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 696)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "gcScannedSyscallStack", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 704)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "activeStackChans", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 712)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "raceignore", file: !31, line: 1, baseType: !209, size: 8, align: 8, offset: 720)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "sysblocktraced", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 728)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "sysexitticks", file: !31, line: 1, baseType: !197, size: 64, align: 64, offset: 768)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "traceseq", file: !31, line: 1, baseType: !175, size: 64, align: 64, offset: 832)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tracelastp", file: !31, line: 1, baseType: !193, size: 64, align: 64, offset: 896)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "lockedm", file: !31, line: 1, baseType: !226, size: 64, align: 64, offset: 960)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "sig", file: !31, line: 1, baseType: !110, size: 32, align: 32, offset: 1024)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "writebuf", file: !31, line: 1, baseType: !358, size: 192, align: 64, offset: 1088)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !9, size: 192, align: 8, elements: !359)
!359 = !{!360, !148, !149}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !125, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode0", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 1280)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "sigcode1", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 1344)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "sigpc", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 1408)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 1472)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ancestors", file: !31, line: 1, baseType: !366, size: 64, align: 64, offset: 1536)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.ancestorInfo,int,int}", file: !9, size: 192, align: 8, elements: !368)
!368 = !{!369, !148, !149}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.ancestorInfo", file: !31, line: 1, size: 320, align: 8, elements: !372)
!372 = !{!373, !378, !379}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "pcs", file: !31, line: 1, baseType: !374, size: 192, align: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uintptr,int,int}", file: !9, size: 192, align: 8, elements: !375)
!375 = !{!376, !148, !149}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "goid", file: !31, line: 1, baseType: !197, size: 64, align: 64, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "gopc", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "startpc", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 1600)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", file: !31, line: 1, baseType: !382, size: 64, align: 64, offset: 1664)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.sudog", file: !31, line: 1, size: 768, align: 8, elements: !384)
!384 = !{!385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "g", file: !31, line: 1, baseType: !16, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "isSelect", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "next", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "prev", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "elem", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 256)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "acquiretime", file: !31, line: 1, baseType: !197, size: 64, align: 64, offset: 320)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "releasetime", file: !31, line: 1, baseType: !197, size: 64, align: 64, offset: 384)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ticket", file: !31, line: 1, baseType: !110, size: 32, align: 32, offset: 448)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "parent", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 512)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "waitlink", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 576)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "waittail", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 640)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "c", file: !31, line: 1, baseType: !397, size: 64, align: 64, offset: 704)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.hchan", file: !31, line: 1, size: 768, align: 8, elements: !399)
!399 = !{!400, !402, !403, !404, !405, !406, !438, !439, !440, !442, !443}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "qcount", file: !31, line: 1, baseType: !401, size: 64, align: 64)
!401 = !DIBasicType(name: "uint", size: 64, encoding: DW_ATE_unsigned)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "dataqsiz", file: !31, line: 1, baseType: !401, size: 64, align: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "buf", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", file: !31, line: 1, baseType: !262, size: 16, align: 16, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "closed", file: !31, line: 1, baseType: !110, size: 32, align: 32, offset: 224)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "elemtype", file: !31, line: 1, baseType: !407, size: 64, align: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime._type", file: !31, line: 1, size: 512, align: 8, elements: !409)
!409 = !{!410, !411, !412, !413, !415, !416, !417, !418, !419, !420, !421, !437}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !31, line: 1, baseType: !107, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !31, line: 1, baseType: !110, size: 32, align: 32, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !31, line: 1, baseType: !414, size: 8, align: 8, offset: 160)
!414 = !DIBasicType(name: ".runtime.tflag", size: 8, encoding: DW_ATE_unsigned)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !31, line: 1, baseType: !112, size: 8, align: 8, offset: 168)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !31, line: 1, baseType: !112, size: 8, align: 8, offset: 176)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !31, line: 1, baseType: !112, size: 8, align: 8, offset: 184)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !31, line: 1, baseType: !309, size: 64, align: 64, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !31, line: 1, baseType: !125, size: 64, align: 64, offset: 256)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_string", file: !31, line: 1, baseType: !127, size: 64, align: 64, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "uncommontype", file: !31, line: 1, baseType: !422, size: 64, align: 64, offset: 384)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.uncommontype", file: !31, line: 1, size: 320, align: 8, elements: !424)
!424 = !{!425, !426, !427}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !31, line: 1, baseType: !127, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !31, line: 1, baseType: !127, size: 64, align: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !31, line: 1, baseType: !428, size: 192, align: 64, offset: 128)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.runtime.method,int,int}", file: !9, size: 192, align: 8, elements: !429)
!429 = !{!430, !148, !149}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !9, line: 1, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.method", file: !31, line: 1, size: 320, align: 8, elements: !433)
!433 = !{!425, !426, !434, !435, !436}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 448)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "sendx", file: !31, line: 1, baseType: !401, size: 64, align: 64, offset: 320)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "recvx", file: !31, line: 1, baseType: !401, size: 64, align: 64, offset: 384)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "recvq", file: !31, line: 1, baseType: !441, size: 128, align: 64, offset: 448)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.waitq", file: !31, line: 1, size: 128, align: 8, elements: !246)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sendq", file: !31, line: 1, baseType: !441, size: 128, align: 64, offset: 576)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "lock", file: !31, line: 1, baseType: !278, size: 64, align: 64, offset: 704)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "labels", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 1728)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "timer", file: !31, line: 1, baseType: !446, size: 64, align: 64, offset: 1792)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: ".runtime.timer", file: !31, line: 1, size: 576, align: 8, elements: !448)
!448 = !{!449, !450, !451, !452, !460, !461, !462, !463}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pp", file: !31, line: 1, baseType: !193, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !31, line: 1, baseType: !197, size: 64, align: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "period", file: !31, line: 1, baseType: !197, size: 64, align: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "f", file: !31, line: 1, baseType: !453, size: 64, align: 64, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !31, line: 1, size: 64, align: 8, elements: !455)
!455 = !{!456}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !31, line: 1, baseType: !457, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!17, !100, !107}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "arg", file: !31, line: 1, baseType: !100, size: 128, align: 64, offset: 256)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "seq", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 384)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "nextwhen", file: !31, line: 1, baseType: !197, size: 64, align: 64, offset: 448)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "status", file: !31, line: 1, baseType: !110, size: 32, align: 32, offset: 512)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "selectDone", file: !31, line: 1, baseType: !110, size: 32, align: 32, offset: 1856)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "gcAssistBytes", file: !31, line: 1, baseType: !197, size: 64, align: 64, offset: 1920)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "exception", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 1984)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "isforeign", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 2048)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "gcstack", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 2112)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "gcstacksize", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 2176)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsegment", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 2240)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 2304)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 2368)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "gcnextsp2", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 2432)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "gcinitialsp2", file: !31, line: 1, baseType: !16, size: 64, align: 64, offset: 2496)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "gcregs", file: !31, line: 1, baseType: !476, size: 7552, align: 64, offset: 2560)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 7552, align: 8, elements: !477)
!477 = !{!478}
!478 = !DISubrange(count: 118, lowerBound: 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "entry", file: !31, line: 1, baseType: !480, size: 64, align: 64, offset: 10112)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !31, line: 1, size: 64, align: 8, elements: !482)
!482 = !{!483}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !31, line: 1, baseType: !484, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!17, !16}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "entryfn", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 10176)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "entrysp", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 10240)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "fromgogo", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 10304)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "scanningself", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 10312)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "scang", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 10368)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "scangcw", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 10432)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "isSystemGoroutine", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 10496)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "isFinalizerGoroutine", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 10504)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "deferring", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 10512)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "goexiting", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 10520)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ranCgocallBackDone", file: !31, line: 1, baseType: !41, size: 8, align: 8, offset: 10528)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", file: !31, line: 1, baseType: !107, size: 64, align: 64, offset: 10560)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "context", file: !31, line: 1, baseType: !476, size: 7552, align: 64, offset: 10624)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "stackcontext", file: !31, line: 1, baseType: !501, size: 640, align: 64, offset: 18176)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 640, align: 8, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 10, lowerBound: 0)
!504 = !DILocalVariable(name: "$this23", arg: 1, scope: !88, file: !31, line: 1, type: !73)
!505 = !DILocation(line: 1, column: 1, scope: !88)
!506 = !DILocalVariable(name: "$ret1", scope: !88, file: !31, line: 1, type: !91)
!507 = distinct !DISubprogram(name: "main.runtime.push..stub..1struct.4runtime.gList.2.runtime.n.0int32.5", scope: null, file: !31, line: 1, type: !508, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !5)
!508 = !DISubroutineType(types: !509)
!509 = !{!17, !73, !73, !91}
!510 = !DILocalVariable(name: "$this24", arg: 1, scope: !507, file: !31, line: 1, type: !73)
!511 = !DILocation(line: 1, column: 1, scope: !507)
!512 = !DILocalVariable(name: "$p25", arg: 2, scope: !507, file: !31, line: 1, type: !91)
!513 = distinct !DISubprogram(name: "main.runtime.empty..stub..1struct.4runtime.gList.2.runtime.n.0int32.5", scope: null, file: !31, line: 1, type: !514, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !5)
!514 = !DISubroutineType(types: !515)
!515 = !{!41, !73, !73}
!516 = !DILocalVariable(name: "$this26", arg: 1, scope: !513, file: !31, line: 1, type: !73)
!517 = !DILocation(line: 1, column: 1, scope: !513)
!518 = !DILocalVariable(name: "$ret2", scope: !513, file: !31, line: 1, type: !41)
!519 = distinct !DISubprogram(name: "main.struct.4runtime.gList.2.runtime.n.0int32.5..eq", linkageName: "main.struct.4runtime.gList.2.runtime.n.0int32.5..eq", scope: null, file: !36, line: 1, type: !122, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!520 = !DILocalVariable(name: "key1", arg: 1, scope: !519, file: !36, line: 1, type: !16)
!521 = !DILocation(line: 1, column: 1, scope: !519)
!522 = !DILocalVariable(name: "key2", arg: 2, scope: !519, file: !36, line: 1, type: !16)
!523 = !DILocalVariable(name: "$ret3", scope: !519, file: !36, line: 1, type: !41)
!524 = distinct !DISubprogram(name: "main.eq", scope: null, file: !36, line: 1, type: !122, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !5)
!525 = !DILocalVariable(name: "key1", arg: 1, scope: !524, file: !36, line: 1, type: !16)
!526 = !DILocation(line: 1, column: 1, scope: !524)
!527 = !DILocalVariable(name: "key2", arg: 2, scope: !524, file: !36, line: 1, type: !16)
!528 = !DILocalVariable(name: "$ret4", scope: !524, file: !36, line: 1, type: !41)
!529 = distinct !DISubprogram(name: "main.eq", scope: null, file: !36, line: 1, type: !122, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !5)
!530 = !DILocalVariable(name: "key1", arg: 1, scope: !529, file: !36, line: 1, type: !16)
!531 = !DILocation(line: 1, column: 1, scope: !529)
!532 = !DILocalVariable(name: "key2", arg: 2, scope: !529, file: !36, line: 1, type: !16)
!533 = !DILocalVariable(name: "$ret5", scope: !529, file: !36, line: 1, type: !41)
!534 = distinct !DISubprogram(name: "main.eq", scope: null, file: !36, line: 1, type: !122, scopeLine: 1, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !5)
!535 = !DILocalVariable(name: "key1", arg: 1, scope: !534, file: !36, line: 1, type: !16)
!536 = !DILocation(line: 1, column: 1, scope: !534)
!537 = !DILocalVariable(name: "key2", arg: 2, scope: !534, file: !36, line: 1, type: !16)
!538 = !DILocalVariable(name: "$ret6", scope: !534, file: !36, line: 1, type: !41)
!539 = distinct !DISubprogram(name: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", linkageName: "main.struct.4Size.0uint32.2Mallocs.0uint64.2Frees.0uint64.5..eq", scope: null, file: !36, line: 1, type: !122, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
